# ProgressChangedEventArgs Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProgressChangedEventArgs Class
Members See Also
---
The event arguments used by the ProgressChanged event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class ProgressChangedEventArgs : RevitAPISingleEventArgs
```

Visual Basic
---
```text
Public Class ProgressChangedEventArgs _
	Inherits RevitAPISingleEventArgs
```

Visual C++
---
```text
public ref class ProgressChangedEventArgs : public RevitAPISingleEventArgs
```

# Inheritance Hierarchy
System..::..Object System..::..EventArgs Autodesk.Revit.DB.Events..::..RevitAPIEventArgs Autodesk.Revit.DB.Events..::..RevitAPISingleEventArgs Autodesk.Revit.DB.Events..::..ProgressChangedEventArgs
# See Also
ProgressChangedEventArgs Members
Autodesk.Revit.DB.Events Namespace